dic = {'.-':'A',
'-...':'B',
'-.-.':'C',
'-..':'D',
'.':'E',
'..-.':'F',
'-- .':'G',
'....':'H',
'..':'I',
'.---':'J',
'-.-':'K',
'.-..':'L',
'--':'M',
'-.':'N',
'---':'O',
'.--.':'P',
'--.-':'Q',
'.-.':'R',
'...':'S',
'-':'T',
'..-':'U',
'...-':'V',
'.--':'W',
'-..-':'X',
'-.--':'Y',
'--..':'Z'}

str = input('모스부호 입력:')
new_str = str
str = str.split()
# ....
# a = dic['....']
for i in str:
    if i in dic:
        new_str = new_str.replace(i, dic[i], 1)
        #         ---------------           ---
        #       dic value 바꿔주는 함수    바꿀 횟수

print(new_str)